"""
Программа запрашивает у пользователя строку чисел, разделенных пробелом. При нажатии Enter должна выводиться сумма чисел.
Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
Но если вместо числа вводится специальный символ, выполнение программы завершается.
Если специальный символ введен после нескольких чисел, то вначале нужно добавить сумму этих чисел к полученной ранее сумме
и после этого завершить программу.
"""
# sm = 0
# q = False
# while q == False:
#     numbers = input("Введи числа через пробел или Q для выхода ").split()
#     for i in numbers:
#         if i == "Q":
#             q = True
#             break
#         else:
#             sm += int(i)
# print(sm)
