"""
Программа принимает действительное положительное число x и целое отрицательное число y.
Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y).
При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
"""


# Возведение в степень с помощью оператора **
def my_func(x, y):
    return x ** y


# Возведение в степень с помощью цикла
def my_func2(x, y):
    if y == 0:
        return 1
    if y == -1:
        return 1. / x
    p = my_func2(x, y // 2)
    p *= p
    if y % 2:
        p *= x
    return round(p, 2)


print(my_func(10, -2))
print(my_func2(10, -2))
