"""
Создать текстовый файл (не программно), построчно записать фамилии сотрудников и величину их окладов (не менее 10 строк).
Определить, кто из сотрудников имеет оклад менее 20 тыс., вывести фамилии этих сотрудников.
Выполнить подсчет средней величины дохода сотрудников.
"""

with open("task3.txt") as salary_file:
    print("Сотрудники с окладом менее 20000: ")
    salaries = 0
    for i, item in enumerate(salary_file.readlines()):
        wk = item.split()
        if int(wk[1]) < 20000:
            print(wk[0])
        salaries += int(wk[1])
    print("Средняя зарплата = ", salaries / (i + 1))